In [1]:
import numpy as np
import pandas as pd
from matplotlib import pyplot as plt

In [11]:
df = pd.read_csv('./sample/chicago.csv')
df.head()

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00

In [12]:
df.describe()

                     Name  Position Title Department Employee Annual Salary
count               32062           32062      32062                  32062
unique              31776            1093         35                   1156
top     KELLY,  MICHAEL J  POLICE OFFICER     POLICE              $87384.00
freq                    4            9184      12618                   2394

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32063 entries, 0 to 32062
Data columns (total 4 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Name                    32062 non-null  object
 1   Position Title          32062 non-null  object
 2   Department              32062 non-null  object
 3   Employee Annual Salary  32062 non-null  object
dtypes: object(4)
memory usage: 1002.1+ KB

In [14]:
df.isnull().sum()

Name                      1
Position Title            1
Department                1
Employee Annual Salary    1
dtype: int64